=========
Number Literal
=========

1

---

(source_file
  (expression
    (primary_expression
      (number))))

=========
Double Literal
=========

1.0

---

(source_file
  (expression
    (primary_expression
      (number))))

=========
False Keyword
=========

false

---

(source_file
  (expression
    (primary_expression
      (boolean))))

=========
True Keyword
=========

true

---

(source_file
  (expression
    (primary_expression
      (boolean))))

=========
Null Keyword
=========

null

---

(source_file
  (expression
    (primary_expression
      (null))))

=========
String Literal
=========

"hello"

---

(source_file
  (expression
    (primary_expression
      (string_literal))))

=========
String Literal With Template
=========

"hello ${name}"

---

(source_file
  (expression
    (primary_expression
      (string_literal))))

=========
Custom Variables
=========

$hello

---

(source_file
  (expression
    (primary_expression
      (variable
        (identifier)))))

=========
Context Variables
=========

@hello

---

(source_file
  (expression
    (primary_expression
      (variable
        (identifier)))))
