=========
Number Literal
=========

1

---

(source_file
  (expression
    (primary_expression
      (number))))

=========
Double Literal
=========

1.0

---

(source_file
  (expression
    (primary_expression
      (number))))

=========
False Keyword
=========

false

---

(source_file
  (expression
    (primary_expression
      (boolean))))

=========
True Keyword
=========

true

---

(source_file
  (expression
    (primary_expression
      (boolean))))

=========
Null Keyword
=========

null

---

(source_file
  (expression
    (primary_expression
      (null))))

=========
String Literal
=========

"hello"

---

(source_file
  (expression
    (primary_expression
      (string_literal))))

=========
String Literal With Template
=========

"hello ${name}"

---

(source_file
  (expression
    (primary_expression
      (string_literal))))

=========
Custom Variables
=========

$hello

---

(source_file
  (expression
    (primary_expression
      (variable
        (identifier)))))

=========
Context Variables
=========

@hello

---

(source_file
  (expression
    (primary_expression
      (variable
        (identifier)))))

=========
Function Call
=========

hello()

---

(source_file
  (expression
    (primary_expression
      (function_call
        (identifier)))))

=========
Function call with arguments
=========

hello(1, 2)

---

(source_file
  (expression
    (primary_expression
      (function_call
        (identifier)
        (argument_list
          (expression
            (primary_expression
              (number)))
          (expression
            (primary_expression
              (number))))))))

=========
Grouped Expression
=========

(1)

---

(source_file
  (expression
    (primary_expression
      (grouped_expression
        (expression
          (primary_expression
            (number)))))))

=========
List Literal
=========

[1, 2]

---

(source_file
  (expression
    (primary_expression
      (list
        (expression
          (primary_expression
            (number)))
        (expression
          (primary_expression
            (number)))))))

=========
Map Literal
=========

{a: 1}

---

(source_file
  (expression
    (primary_expression
      (map
        (key_value
          (expression
            (primary_expression
                  (identifier)))
          (expression
            (primary_expression
              (number))))))))
